Revit 2027 API
TemporaryGraphicsManager.Clear Method
 Clear all temporary graphics objects managed by this manager.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Clear()
Public Sub Clear
public:
void Clear()
member Clear : unit -> unit
See Also
Reference
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace